tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "oven-sh/bun"
tap "showwin/speedtest"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
tap "xgadget-lab/nexttrace"
tap "xxxbrian/tap", "git@github.com:xxxbrian/homebrew-tap.git"
tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Next generation open source RPC library and framework
brew "grpc"
# High-performance theorem prover
brew "z3"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Download with resuming and segmented downloading
brew "aria2"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Interface bandwidth monitor
brew "bmon"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# OpenType text shaping engine
brew "harfbuzz"
# Library for encoding and decoding .avif files
brew "libavif"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler2"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Static analysis of C and C++ code
brew "cppcheck"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line DNS Client for Humans
brew "doggo"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GNU compiler collection
brew "gcc"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Git for data science projects
brew "dvc"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# High performance message passing library
brew "open-mpi"
# Modern, performance focused unix commands
brew "fuc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Development kit for the Java programming language
brew "openjdk@17"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle@7"
# File format designed to store large amounts of data
brew "hdf5"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# macOS Big Sur Adaptive Icon Generator
brew "iconsur"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Dex to Java decompiler
brew "jadx"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Neural Network Go engine with no human-provided knowledge
brew "katago"
# Lazier way to manage everything docker
brew "lazydocker"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Next-gen compiler infrastructure
brew "llvm@16"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Fast and simple video downloader
brew "lux"
# Menu-driven communications program
brew "minicom"
# High performance static file server
brew "miniserve"
# C library for zip/unzip via zLib
brew "minizip"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# QUIC transport protocol implementation
brew "mvfst"
# Tool for querying IP geographic information and CDN provider
brew "nali"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# App source + Nix packages + Docker = Image
brew "nixpacks"
# Port scanning utility for large networks
brew "nmap"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# Development kit for the Java programming language
brew "openjdk@11"
# Painless compression and decompression for your terminal
brew "ouch"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written in Rust
brew "procs"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Bindings to the libgit2 shared library
brew "pygit2"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Cross-platform application and UI framework
brew "qt@5"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup"
# Experimental Package Management Solution for Python
brew "rye"
# Small man page generator
brew "scdoc"
# Display and control your Android device
brew "scrcpy"
# SMART hard drive monitoring
brew "smartmontools"
# Speex audio processing library
brew "speexdsp"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to impose load on and stress test a computer system
brew "stress"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code spell checker
brew "typos-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Image processing library
brew "vips"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi", args: ["HEAD"]
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# speedtest cli
brew "showwin/speedtest/speedtest"
# A command-line tool to select default applications, based on duti
brew "tsonglew/dutis/dutis"
# An open source visual route tracking CLI tool
brew "xgadget-lab/nexttrace/nexttrace"
# Utility tool for UNSW CSE students to run course commands locally
brew "xxxbrian/tap/cserun"
# 7-Zip is a file archiver with a high compression ratio
brew "xxxbrian/tap/sevenzip-full"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Intelligent cloud storage platform
cask "adrive"
# GPU-accelerated terminal emulator
cask "alacritty-full"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Inspect application bundles
cask "apparency"
# Chromium based browser
cask "arc"
# Electronics prototyping platform
cask "arduino-ide"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Voice and text chat software
cask "discord"
# Social software for creating music short videos
cask "douyin"
# Launcher for *Epic Games* games
cask "epic-games"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-color-emoji"
cask "font-symbols-only-nerd-font"
# Convert RAW images captured with Fujifilm cameras
cask "fujifilm-x-raw-studio"
# Web browser
cask "google-chrome"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Free and open-source media player
cask "iina"
# Hex editor for reverse engineers
cask "imhex"
# App for (re)signing iOS apps and bundling them
cask "ios-app-signer"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Window manager
cask "loop"
# UI replacement for volume, brightness and now playing controls
cask "mediamate"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Sandbox construction video game
cask "minecraft"
# Run Stable Diffusion natively
cask "mochi-diffusion"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Open-source download manager
cask "motrix"
# Music streaming platform
cask "neteasemusic"
# Tool to scan and monitor the network
cask "network-radar"
# App to write, plan, collaborate, and get organised
cask "notion"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# Companion app for Flipper Zero devices
cask "qflipper"
# Control your tools with a few keystrokes
cask "raycast"
# Advanced API Debugging Proxy
cask "reqable"
# Open source virtual/remote desktop application
cask "rustdesk"
# Go board and SGF editor
cask "sabaki"
# Collection of apps available by subscription
cask "setapp"
# Open source cross-platform file explorer
cask "spacedrive"
# Music streaming service
cask "spotify"
# Rime input method engine
cask "squirrel"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Network toolbox
cask "surge"
# Application for inspecting installer packages
cask "suspicious-package"
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Cloud video conferencing
cask "tencent-meeting"
# VPN and WiFi proxy
cask "thunder"
# Multi-platform VNC client and server
cask "tigervnc-viewer"
# Git client focusing on power and productivity
cask "tower"
# Configurable document editor that supports Markdown
cask "typora"
# Management tool for Unity
cask "unity-hub"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Text input app from WeChat team for Chinese users
cask "wetype"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Wine wrapper built with SwiftUI
cask "whisky"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Mesh VPN client
cask "zerotier-one"
# Video communication and virtual meeting platform
cask "zoom"
vscode "ahmadawais.shades-of-purple"
vscode "antfu.icons-carbon"
vscode "bitwisecook.tcl"
vscode "bradlc.vscode-tailwindcss"
vscode "campbellhe.vscode-mips-mars"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "icrawl.discord-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "kdarkhan.mips"
vscode "kelvin.vscode-sshfs"
vscode "leetcode.vscode-leetcode"
vscode "lennartlence.chadcommit"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "pest.pest-ide-tools"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shengchen.vscode-checkstyle"
vscode "sj0000e.hexdiff"
vscode "skellock.just"
vscode "stivo.tailwind-fold"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tekumara.typos-vscode"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
